Revit 2024 API
BuiltInFailures.FabricFailures.BendPolylineInvalid Property
 The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BendPolylineInvalid { get; }
Visual Basic
Public Shared ReadOnly Property BendPolylineInvalid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BendPolylineInvalid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace